// [3:42 pm, 12/06/2022] Netowrk Programing: بالله تشتغلي علي هذه النقاط إلى أن يتم تجهيز api
// [3:45 pm, 12/06/2022] Netowrk Programing: محتاج جميع الحركات التي ترتبط بالتوقيت  تاخذ التوقيت من داوم
// [3:55 pm, 12/06/2022] Netowrk Programing: محتاج عندما يقوم الموظف على الموافقة تظهر له رسالة تأكيد هل انت متأكد من الموافقة على الطلب جميع الطلبات
// وفي حالة الرفض يجب ظهور   رسالة تأكيد مع كتابت سبب الرفض
// [4:02 pm, 12/06/2022] Netowrk Programing: يظهر رقم بالأحمر في الاشعارات التي لم يتم فتحها
// محتاج يظهر رقم بالأحمر  وهو عدد الطلبات المعلقة التي لم يتم رفضها او قبولها موافقات الإجازات او الاستئذان وذلك على
// التطبيق من الخارج يظهر عليه رقم بالأحمر به إجمالي عدد الطلبات والاشعارات التي لم يتم اخذ إجراء عليها موافقة او رفض او عدم رؤية اشعار
// [4:06 pm, 12/06/2022] Netowrk Programing: ارسلت لحضرتك رابط بخصوص بصمة الوجه ما رديتي عليه فيه
// بالله ياهندسه تاخدي كل النقاط وتسجليها عند حضرتك وكل نقطة تتنفذ تعطيها تم التنفيذ حتى لا ننسى شيء
// [4:09 pm, 12/06/2022] Netowrk Programing: https://morioh.com/p/2e28055a9e86
// [4:10 pm, 12/06/2022] Netowrk Programing: هذا رابط كود بصمة الوجه وكيفة تنفيذه بالفلتر
// [4:19 pm, 12/06/2022] Netowrk Programing: رقم بالحمر على التطبيق من الخارج يساوي إجمالي الأرقام الداخلية
